app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("description", "created_at", "updated_at", "user_id", "tasktype_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["description", "Ioan are un caine."], ["created_at", "2017-08-17 07:49:19.935066"], ["updated_at", "2017-08-17 07:49:19.935066"], ["user_id", 1], ["tasktype_id", 1]]
---
    task = Task.create(api_params(:description, :user_id, :tasktype_id))

UPDATE "tasks" SET "status" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["status", 1], ["updated_at", "2017-08-18 06:53:40.128796"], ["id", 8]]
---
  def update
    task.update(status: status_params) if Task::StatusTransition.status_transition(task, status_params)